### [ DataFrame 행/열 추가 ]

#### (1) 모듈 로딩

In [1]:
import pandas as pd

#### (2) 데이터 준비

In [2]:
# dict 타입의 데이터 생성
exam = {'이름' : ['마징가', '배트맨', '홍길동', '임꺽정'],
       '국어' : [98, 79, 99, 100],
       '미술' : [70, 99, 87, 80],
       '수학' : [98, 79, 99, 72],
       '체육' : [80, 93, 69, 91],
       '영어' : [40, 50, 60, 70]}

#### (3) DataFrame에 데이터 저장

In [3]:
examDF = pd.DataFrame(exam)

In [4]:
examDF

    이름   국어  미술  수학  체육  영어
0  마징가   98  70  98  80  40
1  배트맨   79  99  79  93  50
2  홍길동   99  87  99  69  60
3  임꺽정  100  80  72  91  70

#### (4) 저장된 데이터 속성 확인 <hr>

In [5]:
def printAttribute(df, dfname):
    print(f'{dfname}\n')    
    print(f'index\n ====> {df.index}')
    print(f'column\n ====> {df.columns}')
    print(f'shape\n ====> {df.shape}')
    print(f'ndim\n ====> {df.ndim}')
    print(f'size\n ====> {df.size}')
    print(f'dtype\n ====> {df.dtypes}')

In [6]:
printAttribute(examDF, 'examDF')

examDF

index
 ====> RangeIndex(start=0, stop=4, step=1)
column
 ====> Index(['이름', '국어', '미술', '수학', '체육', '영어'], dtype='object')
shape
 ====> (4, 6)
ndim
 ====> 2
size
 ====> 24
dtype
 ====> 이름    object
국어     int64
미술     int64
수학     int64
체육     int64
영어     int64
dtype: object

#### (5) DataFrame에 컬럼 (column) 추가 <hr>
- 방법 : DF개체변수명[새로운 컬럼명] = 값

In [7]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육', '영어'], dtype='object')

In [8]:
examDF

    이름   국어  미술  수학  체육  영어
0  마징가   98  70  98  80  40
1  배트맨   79  99  79  93  50
2  홍길동   99  87  99  69  60
3  임꺽정  100  80  72  91  70

In [9]:
examDF['과학'] = 10

In [10]:
examDF

    이름   국어  미술  수학  체육  영어  과학
0  마징가   98  70  98  80  40  10
1  배트맨   79  99  79  93  50  10
2  홍길동   99  87  99  69  60  10
3  임꺽정  100  80  72  91  70  10

In [11]:
# 1개의 데이터 즉 값추가 시 모든 행에 동일 값으로 저장
# examDF['컴퓨터'] = [89, 10]

In [12]:
examDF[6] = 20

In [13]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육', '영어', '과학', 6], dtype='object')

#### (6) DataFrame에 행(row) 추가 <hr>
- 방법 : DF객체변수명.loc[새로운 행인덱스] = [컬럼수 만큼 데이터]
- 방법 : DF객체변수명.loc[새로운 행인덱스] = 데이터
- 불가방법 : DF객체변수명.iloc[새로운 행인덱스] = 데이터 => 데이터 존재해야만 인덱스 할당됨

In [14]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
# 컬럼 수 만큼의 데이터를 가진 행 추가
examDF.loc[4] = ['원더우먼', 90, 87, 99 ,87, 67, 80, 100]

In [16]:
examDF

     이름   국어  미술  수학  체육  영어  과학    6
0   마징가   98  70  98  80  40  10   20
1   배트맨   79  99  79  93  50  10   20
2   홍길동   99  87  99  69  60  10   20
3   임꺽정  100  80  72  91  70  10   20
4  원더우먼   90  87  99  87  67  80  100

In [17]:
# 행 추가시 iloc는 사용 불가 => Why? 데이터 수에 맞게 인덱스 범위 지정 되기 때문에

# examDF.iloc[5] = ['슈퍼맨', 90, 87, 99 ,87, 67, 80, 100]

In [18]:
# 1개 데이터를 가진 행 추가
examDF.loc[5] = '슈퍼맨'

In [19]:
examDF

     이름   국어   미술   수학   체육   영어   과학    6
0   마징가   98   70   98   80   40   10   20
1   배트맨   79   99   79   93   50   10   20
2   홍길동   99   87   99   69   60   10   20
3   임꺽정  100   80   72   91   70   10   20
4  원더우먼   90   87   99   87   67   80  100
5   슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨